In [1]:
class Demo:
    def __init__(self):
        pass
    
    def fun1(self):
        a=3
        return a

In [2]:
obj = Demo()

In [3]:
obj.fun1()

3

In [6]:
class Demo:
    def __init__(self):
        pass
    
    def fun1(self):
        self.a=3
        return self.a

In [7]:
obj.fun1()

3

In [9]:
import pandas as pd

In [8]:
path = r"C:\Users\user\Desktop\real_ml_projects\Wafar_fault_detection\waferFaultDetection\code\WaferFaultDetection_new\Training_Batch_Files\Wafer_11012020_151432.csv"

In [11]:
df=pd.read_csv(path)

In [12]:
df

,Unnamed: 0,Sensor-1,Sensor-2,Sensor-3,Sensor-4,Sensor-5,Sensor-6,Sensor-7,Sensor-8,Sensor-9,...,Sensor-581,Sensor-582,Sensor-583,Sensor-584,Sensor-585,Sensor-586,Sensor-587,Sensor-588,Sensor-589,Sensor-590
0,Wafer-100,3056.50,2481.09,2220.4444,1637.2946,1.3680,100,100.5189,0.1231,1.4402,...,0.0037,35.2148,0.5009,0.0153,0.0035,3.0545,0.0338,0.0119,0.0037,35.2148
1,Wafer-101,3017.50,2634.30,2183.4556,955.9073,1.1048,100,102.6978,0.1223,1.4700,...,0.0050,71.5753,0.5059,0.0082,0.0025,1.6240,0.0208,0.0149,0.0050,71.5753
2,Wafer-102,3003.13,2714.30,2171.9000,1811.8799,1.3811,100,99.2200,0.1276,1.4240,...,0.0060,289.9234,0.4990,0.0119,0.0027,2.3794,0.0058,0.0169,0.0060,289.9234
3,Wafer-103,2924.23,2531.34,2196.6555,1066.1908,1.2188,100,101.8900,0.1211,1.3872,...,NaN,NaN,0.5001,0.0115,0.0027,2.2920,0.0058,0.0169,0.0060,289.9234
4,Wafer-104,3023.86,2432.85,2172.3666,1752.3206,1.3622,100,97.2633,0.1269,1.4712,...,NaN,NaN,0.5009,0.0100,0.0029,1.9890,0.0058,0.0169,0.0060,289.9234
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,Wafer-195,3076.52,2502.62,2197.6444,1247.0334,0.7865,100,99.9211,0.1203,1.5059,...,0.0048,51.8065,0.5025,0.0144,0.0038,2.8593,0.0287,0.0149,0.0048,51.8065
96,Wafer-196,2999.86,2287.90,2197.6444,1247.0334,0.7865,100,99.9211,0.1203,1.4785,...,0.0029,31.4679,0.5047,0.0124,0.0038,2.4550,0.0265,0.0083,0.0029,31.4679
97,Wafer-197,2992.52,2470.14,2197.6444,1247.0334,0.7865,100,99.9211,0.1203,1.4703,...,0.0035,59.3840,0.5047,0.0093,0.0033,1.8502,0.0214,0.0127,0.0035,59.3840
98,Wafer-198,3109.02,2472.13,2197.6444,1247.0334,0.7865,100,99.9211,0.1203,1.4406,...,0.0041,44.1766,0.4999,0.0102,0.0029,2.0404,0.0327,0.0144,0.0041,44.1766
99,Wafer-199,2954.10,2489.91,2179.0445,2028.2208,1.5552,100,95.4256,0.1234,1.4685,...,0.0052,98.1126,0.5035,0.0130,0.0034,2.5797,0.0131,0.0129,0.0052,98.1126

In [18]:
df.isna().sum()

Unnamed: 0    0
Sensor-1      0
Sensor-2      0
Sensor-3      0
Sensor-4      0
             ..
Sensor-586    0
Sensor-587    0
Sensor-588    0
Sensor-589    0
Sensor-590    0
Length: 591, dtype: int64

In [45]:
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':[None, 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', None, 'MCA',None]}

In [46]:
df=pd.DataFrame(data)

In [47]:
df

     Name  Age    Address Qualification
0     Jai   27       None           Msc
1  Princi   24     Kanpur          None
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj          None

In [48]:
df.isna().sum()

Name             0
Age              0
Address          1
Qualification    2
dtype: int64

In [49]:
df_null= pd.DataFrame()
df_null['Columns'] = df.columns

In [50]:
df_null

         Columns
0           Name
1            Age
2        Address
3  Qualification

In [51]:
np.asarray(df.isna().sum())

array([0, 0, 1, 2], dtype=int64)

In [52]:
df_null['Missing Value'] = np.asarray(df.isna().sum())

In [53]:
df_null

         Columns  Missing Value
0           Name              0
1            Age              0
2        Address              1
3  Qualification              2

In [56]:
np.nan

nan

In [57]:
df

     Name  Age    Address Qualification
0     Jai   27       None           Msc
1  Princi   24     Kanpur          None
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj          None

In [60]:
df.describe()

             Age
count   4.000000
mean   26.250000
std     4.349329
min    22.000000
25%    23.500000
50%    25.500000
75%    28.250000
max    32.000000

In [61]:
df_n = df.describe()

In [62]:
df_n['Age']

count     4.000000
mean     26.250000
std       4.349329
min      22.000000
25%      23.500000
50%      25.500000
75%      28.250000
max      32.000000
Name: Age, dtype: float64

In [63]:
df_n['Age']['std']

4.349329450233296

In [64]:
df

     Name  Age    Address Qualification
0     Jai   27       None           Msc
1  Princi   24     Kanpur          None
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj          None

In [66]:
df['Name'].unique()

array(['Jai', 'Princi', 'Gaurav', 'Anuj'], dtype=object)